{
  "app_name": "Truecaller",
  "app_version": null,
  "overall_score": 5.5,
  "privacy_concerns": [
    {
      "clause": "Personal data collected through your use of Truecaller services",
      "severity": "high",
      "explanation": "The app collects extensive data, including device information, usage patterns, and call/message metadata. While some of this is necessary for functionality, the breadth of data collected raises privacy concerns, especially for Canadian users who may expect stricter data minimization practices.",
      "quote": "Examples include your actions with the Truecaller Services such as: how you use our Services (including the features you use, time, frequency, and duration of your usage), and configure them; how the Services are being accessed (via another service, website or a search engine); how you interact with other users and numbers including by tagging, blocking, calling or messaging them."
    },
    {
      "clause": "Message data processing",
      "severity": "medium",
      "explanation": "The app processes SMS and MMS data, including metadata and media files, for spam detection and categorization. While this is done with user consent, the use of AI for categorization and potential sharing of masked data for analysis could lead to privacy risks if not properly anonymized.",
      "quote": "With your consent, we perform on-device processing of your SMS and MMS to identify and block spam and fraud, to help you categorize and organize your messages, to provide smart summaries (both as notifications and in-app) and reminders for transactional SMSs."
    },
    {
      "clause": "Call data collection",
      "severity": "medium",
      "explanation": "The app collects detailed call data, including phone numbers, call durations, and volumes. While this is necessary for call tracking features, the extent of data collected may be excessive for users who prioritize privacy.",
      "quote": "Examples include your phone number, time and date of calls, duration of calls and volumes of calls."
    },
    {
      "clause": "Service-specific personal data (e.g., Call Recording)",
      "severity": "high",
      "explanation": "The app processes sensitive data such as call recordings and transcripts for certain services. Although users are informed and data is deleted after a set period, the potential for misuse of this data (e.g., AI training) is concerning.",
      "quote": "If you explicitly consent, we may select segments of raw or partially processed audio and associated transcriptions to use as training data to automatically train our proprietary artificial intelligence (AI) technology."
    },
    {
      "clause": "Approximate location collection",
      "severity": "low",
      "explanation": "The app collects approximate location data based on IP addresses and other technical data. This is relatively standard and less intrusive, but users should still be aware of this practice.",
      "quote": "General location of users that include country, region or state. We learn this from technical data (e.g. IP address, language setting of your device or phone number)."
    }
  ],
  "summary": "Truecaller's privacy policy outlines extensive data collection practices, including device information, usage patterns, and sensitive data like call recordings and message metadata. While some data collection is necessary for functionality, the breadth and depth of data collected raise privacy concerns for Canadian users. The terms are moderately complex and may not be fully transparent to all users.",
  "red_flags": [
    "Excessive data collection beyond app functionality (e.g., detailed call and message metadata, AI training using user data)",
    "Broad rights to process sensitive data like call recordings and transcripts",
    "Potential sharing of masked message data for analysis",
    "Complex and lengthy terms that may be difficult for users to fully understand"
  ],
  "user_friendliness_score": 6.0,
  "data_collection_score": 4.0,
  "legal_complexity_score": 5.0,
  "terms_version": "16 June 2025",
  "terms_url": "https://www.truecaller.com/privacy-policy-eu",
  "analysis_date": "2025-07-05",
  "deep_analysis": {
    "0": {
      "unclear_terms": [
        {
          "term": "Usage patterns (such as features accessed, usage duration, and interaction with other users or external services)",
          "explanation": "This refers to the app tracking how you use its features (e.g., how often you block numbers, tag contacts, or use specific tools) and how you interact with other users or services connected to the app.",
          "user_impact": "The app is monitoring and recording detailed information about your behavior within the app, which could reveal sensitive patterns about your communication habits.",
          "questions_to_ask": [
            "Why is this level of detail necessary for the app to function?",
            "How long is this data stored, and who has access to it?",
            "Can I opt out of this type of tracking?"
          ]
        },
        {
          "term": "Device information (such as device type, network, and performance details, and online identifiers, such as IP addresses)",
          "explanation": "This means the app collects technical details about your phone or device, including its model, the network you're connected to, and unique identifiers like your IP address.",
          "user_impact": "This data can be used to track your device across different networks and potentially identify you personally, even if you don't provide your name.",
          "questions_to_ask": [
            "What safeguards are in place to protect this data?",
            "Is this data shared with third parties, and if so, for what purpose?",
            "Can I use the app without sharing this information?"
          ]
        },
        {
          "term": "Interaction with other users and numbers (e.g., tagging, blocking, calling, messaging)",
          "explanation": "This refers to the app tracking how you interact with other people through the app, such as tagging contacts, blocking numbers, or sending messages.",
          "user_impact": "This could reveal private details about your relationships, communication preferences, and even disputes (e.g., blocking someone).",
          "questions_to_ask": [
            "Is this data anonymized or linked to my account?",
            "How is this data used, and is it shared with others?",
            "Can I delete this data if I stop using the app?"
          ]
        },
        {
          "term": "Search activity and search terms used",
          "explanation": "This means the app tracks what you search for within the app, including specific names, numbers, or other queries.",
          "user_impact": "This could expose sensitive information about who or what you're looking up, which could be used to infer personal details about you.",
          "questions_to_ask": [
            "Why is search activity being tracked?",
            "Is this data linked to my identity or anonymized?",
            "Can I delete my search history?"
          ]
        },
        {
          "term": "Performance, diagnostics, bugs, crash reports, and logs",
          "explanation": "This refers to the app collecting technical data about errors, crashes, and how well the app is functioning on your device.",
          "user_impact": "While this data is often used to improve the app, it could also include sensitive information if not properly anonymized.",
          "questions_to_ask": [
            "What kind of information is included in these logs?",
            "Is this data anonymized before being stored or shared?",
            "Can I opt out of sharing diagnostic data?"
          ]
        }
      ],
      "practical_meaning": "In practice, Truecaller collects a wide range of data about how you use the app, your device, and your interactions with others. This data is likely used to improve the app, personalize your experience, and potentially for advertising or other business purposes. However, the breadth of data collected raises privacy concerns, as it could reveal sensitive details about your behavior, preferences, and relationships. Additionally, the lack of clarity on how this data is stored, shared, or protected increases the risk of misuse or unauthorized access.",
      "user_action_needed": "Users should carefully review the app's privacy settings and terms to understand what data is being collected and how it is used. If privacy is a concern, users should consider limiting the app's permissions, opting out of non-essential data collection (if possible), and asking Truecaller for more transparency about their data practices. Users may also want to explore alternative apps with stricter privacy policies.",
      "severity_justification": "This issue is flagged as high severity because the extensive data collection practices go beyond what is necessary for the app's core functionality. The lack of clear limits on data use, combined with the potential for sensitive information to be inferred or exposed, poses significant privacy risks to users. This is particularly concerning for users in regions like Canada, where stricter privacy laws and expectations around data minimization exist.",
      "extended_context": "...cation, we will collect information about your device and how you use Truecaller. This includes information on usage patterns (such as features accessed, usage duration, and interaction with other users or external services), search activity and diagnostic data (such as crashes and bugs). This also includes device information such as device type, network, and performance details, and online identifiers, such as IP addresses. [Click here for more details.](#tooltip \"1. Log and event information: Examples include your actions with the Truecaller Services such as:\n\n- how you use our Services (including the features you use, time, frequency, and duration of your usage), and configure them\n\n- how the Services are being accessed (via another service, website or a search engine)\n\n- how you interact with other users and numbers including by tagging, blocking, calling or messaging them, providing input or sending contact requests\n\n- your use of third party services, devices and applications in connection with our Services\n\n- performance, diagnostics, bugs, crash reports and logs\n\n- content you have commented on or sent to us\n\n- information about what you have searched in the Truecaller application and the search terms used\n\nWhen you download the Truecaller application, we collect limited information, including, but not limited to, usage information and other information...",
      "online_research": {
        "search_query": "\"Truecaller\" Usage patterns (such as features accessed, usage duration, and interaction with other users or external services) Device information (such as device type, network, and performance details, and online identifiers, such as IP addresses) Interaction with other users and numbers (e.g., tagging, blocking, calling, messaging) terms conditions privacy policy explanation",
        "top_result_url": null,
        "top_result_title": null,
        "summary": null
      }
    },
    "3": {
      "unclear_terms": [
        {
          "term": "Service-specific personal data (e.g., Call Recording)",
          "explanation": "This refers to personal data collected through specific features of the app, such as call recordings and their transcriptions. This data is tied to the services you use within the app.",
          "user_impact": "The app collects and processes sensitive information like your recorded calls and their transcriptions. This data could potentially include private conversations, personal information, or sensitive details.",
          "questions_to_ask": [
            "What specific safeguards are in place to protect my call recordings and transcriptions?",
            "How is my consent obtained for using my data for AI training?",
            "What happens if I do not consent to the use of my data for AI training?",
            "How is the data anonymized, and can it still be traced back to me?",
            "What happens to the data after the 30-day deletion period?"
          ]
        },
        {
          "term": "Explicit consent",
          "explanation": "This means you must actively agree (e.g., by clicking a checkbox or enabling a setting) before the app can use your data for specific purposes, such as training AI.",
          "user_impact": "If you give explicit consent, your call recordings and transcriptions may be used to train AI systems, even though the app claims to anonymize the data.",
          "questions_to_ask": [
            "How is my explicit consent recorded and stored?",
            "Can I withdraw my consent later, and if so, how?",
            "What happens to my data if I withdraw consent after it has already been used for AI training?"
          ]
        },
        {
          "term": "Anonymisation",
          "explanation": "This refers to the process of removing or altering personal identifiers from data so that it cannot be linked back to an individual.",
          "user_impact": "Even if data is anonymized, there is a risk that it could still be re-identified, especially if combined with other data sources.",
          "questions_to_ask": [
            "What specific methods are used to anonymize my data?",
            "Is there any risk of re-identification of my data?",
            "Who has access to the anonymized data, and how is it protected?"
          ]
        },
        {
          "term": "Data processor",
          "explanation": "A data processor is an entity that processes personal data on behalf of another entity (the data controller). In this case, Truecaller processes your call recordings and transcriptions on your behalf.",
          "user_impact": "You are responsible for ensuring that other parties on the call are informed about the recording and have given their consent, which could expose you to legal risks if you fail to comply.",
          "questions_to_ask": [
            "What are my legal responsibilities as the data controller?",
            "What happens if I fail to inform other parties about the recording?",
            "Does Truecaller provide any tools or guidance to help me comply with these responsibilities?"
          ]
        }
      ],
      "practical_meaning": "Truecaller collects and processes sensitive data like call recordings and transcriptions for certain services. If you explicitly consent, this data may also be used to train their AI systems. While the company claims to anonymize the data and delete it after a set period, there are risks of misuse, re-identification, and potential legal liabilities for users who fail to inform other parties about the recordings.",
      "user_action_needed": "Users should carefully review their privacy settings and decide whether to enable call recording and transcription features. They should also ensure they understand their legal responsibilities for informing other parties about recordings. If users are uncomfortable with their data being used for AI training, they should avoid giving explicit consent and ask for clarification on how their data is handled.",
      "severity_justification": "This issue is flagged as high severity because it involves sensitive personal data (call recordings and transcriptions) that could include private or confidential information. The potential for misuse, such as AI training or re-identification, combined with the legal risks for users, makes this a significant concern.",
      "extended_context": "...he recordings and transcriptions, and will be deleted off our servers as soon as downloaded on your device, and within 30 days the latest. You decide whether to enable transcriptions by changing your privacy settings. Within the nature of these services, we may process information about non-users, such as phone number, name and the information contained in possible recordings and transcriptions. If you are a non-user, you can read more about how we process non-user data under section 17 below.\n\nIf you explicitly consent, we may select segments of raw or partially processed audio and associated transcriptions to use as training data to automatically train our proprietary artificial intelligence (AI) technology, analytics and development purposes of our products. We will take efforts to anonymise such data before processing. Read more under section 4.\")\n\nPlease note that when using the Call Recording service, we act as a data processor for the collection and storing of the audio recordings and transcriptions thereof. You are solely responsible for ensuring that the other parties on the call are promptly informed about the recordings, reasons for such recordings and where necessary receive consent for s...",
      "online_research": {
        "search_query": "\"Truecaller\" Service-specific personal data (e.g., Call Recording) Explicit consent Anonymisation terms conditions privacy policy explanation",
        "top_result_url": null,
        "top_result_title": null,
        "summary": null
      }
    }
  }
}