{
  "app_name": "Waze",
  "app_version": null,
  "overall_score": 6.5,
  "privacy_concerns": [
    {
      "clause": "Detailed location, travel, and route information collection",
      "severity": "high",
      "explanation": "Waze collects extensive location and route data, including GPS signals, IP addresses, and travel history. This data is collected even when the app is not actively in use, which could be seen as invasive and raises concerns about continuous tracking.",
      "quote": "Depending on your selected device settings and/or your account settings we may collect information about your location and travel (or lack thereof) also while you are not using the app."
    },
    {
      "clause": "Integration with third-party services and apps",
      "severity": "medium",
      "explanation": "Waze collects data from third-party apps and services linked to your account, such as music apps or social networks, which could lead to broader data sharing and potential privacy risks.",
      "quote": "Waze may also collect information about apps installed on your device that Waze can link with - such as third party music or media audio service apps (e.g. Spotify)."
    },
    {
      "clause": "Personalized advertising",
      "severity": "medium",
      "explanation": "Waze uses device identifiers and activity data to show personalized ads. While users can opt out of ad personalization, ads are still shown, and the policy does not clarify the extent of data sharing with advertising partners.",
      "quote": "We work with ad partners, including advertisers on our platform and entities that belong to the Google group of companies, in order to show you more relevant and useful ads based on your Waze activity."
    },
    {
      "clause": "Account registration and metadata collection",
      "severity": "medium",
      "explanation": "Even if users do not register an account, Waze creates a unique identifier and collects metadata linked to the user, which may include device and browser information.",
      "quote": "Waze will still link all of your information with the non-registered Account and a unique identifier generated by Waze in accordance with this Privacy Policy."
    },
    {
      "clause": "Data retention policies",
      "severity": "medium",
      "explanation": "The policy does not provide clear timelines for how long data is retained, which could lead to indefinite storage of sensitive user information.",
      "quote": "How Waze retains data we collect."
    }
  ],
  "summary": "Waze's terms and privacy policy provide transparency about data collection but raise concerns about extensive location tracking, third-party integrations, and personalized advertising. While some user controls are available, the policies lean heavily towards data collection and sharing, which may not align with Canadian privacy expectations.",
  "red_flags": [
    "Extensive location tracking, even when the app is not in use",
    "Broad data collection from third-party apps and services",
    "Personalized advertising based on user activity and device identifiers",
    "Unclear data retention timelines",
    "Metadata collection for non-registered accounts"
  ],
  "user_friendliness_score": 6.0,
  "data_collection_score": 4.5,
  "legal_complexity_score": 7.0,
  "terms_version": null,
  "terms_url": "https://support.google.com/waze/answer/12075406?hl=en",
  "analysis_date": "2025-07-05",
  "deep_analysis": {
    "0": {
      "unclear_terms": [
        {
          "term": "Location and route information",
          "explanation": "This refers to data about where you are, where you’ve been, and the routes you’ve taken, collected through GPS signals, your IP address, and other device sensors.",
          "user_impact": "This means Waze is tracking your movements in detail, including your travel history and potentially your location even when you’re not actively using the app.",
          "questions_to_ask": [
            "What specific location data is being collected when I’m not using the app?",
            "How long is my location and route data stored?",
            "Can I opt out of location tracking when the app is not in use?"
          ]
        },
        {
          "term": "Depending on your selected device settings and/or your account settings",
          "explanation": "This means the extent of data collection depends on how your phone and Waze account are configured. For example, if location services are always enabled, Waze may collect data even when the app is closed.",
          "user_impact": "If your settings allow it, Waze could continuously track your location without you realizing it.",
          "questions_to_ask": [
            "How can I check or change my device and account settings to limit tracking?",
            "What are the default settings for location tracking in Waze?",
            "Does Waze notify me when it’s collecting location data in the background?"
          ]
        },
        {
          "term": "While you are not using the app",
          "explanation": "This means Waze can collect your location and travel data even when the app is closed or not actively being used.",
          "user_impact": "Your movements may be tracked at all times, which could feel invasive and raise privacy concerns.",
          "questions_to_ask": [
            "Why does Waze need to collect my location data when I’m not using the app?",
            "Can I turn off background location tracking without losing core app functionality?",
            "What is Waze doing to protect this data from being misused or accessed by unauthorized parties?"
          ]
        },
        {
          "term": "Analyze how effective our ads are",
          "explanation": "This means Waze uses your location and travel data to measure how well their advertisements are performing, such as whether you visited a location after seeing an ad.",
          "user_impact": "Your location data is being used for advertising purposes, which may feel intrusive if you were unaware of this practice.",
          "questions_to_ask": [
            "Can I opt out of my data being used for ad analysis?",
            "What specific data is shared with advertisers?",
            "How does Waze ensure my data is anonymized before being used for advertising?"
          ]
        }
      ],
      "practical_meaning": "Waze collects and stores detailed information about your location, travel habits, and routes, even when the app is not actively in use. This data is used for features like traffic notifications, parking assistance, and ad targeting. However, it also means Waze could be continuously tracking your movements, which raises significant privacy concerns.",
      "user_action_needed": "Users should review their device and account settings to understand and limit location tracking. Disable background location tracking if you’re uncomfortable with continuous monitoring. Check Waze’s privacy settings to opt out of data collection for advertising purposes, if possible.",
      "severity_justification": "This was flagged as high severity because continuous location tracking, especially when the app is not in use, can feel invasive and may expose users to privacy risks. The use of this data for advertising purposes without clear, upfront consent further compounds the concern.",
      "extended_context": "...rmation**. Location and route information is collected for example in the form of GPS signals (combined with a time-stamp), IP address and other information from sensors and receivers on or around your device, on which the Application is installed and/or activated. This location and route information is saved to a route history of all of the journeys you have made while using the Application. The types of location data we collect depends in part on your device and account settings. For example, depending on your selected device settings and/or your account settings we may collect information about your location and travel (or lack thereof) also while you are not using the app, in order to be able to tell you when to leave for planned or predicted drives, notify you about bad traffic in your area, provide you parking assistance, analyze how effective our ads are and more; \n    *   Terms or venues you searched;\n    *   Your views and interactions with content and ads;\n    *   Your voice and audio information when you use voice and audio features;\n    *   Communication or other content you chose to share with any third party, including Waze users through the Services;\n ...",
      "online_research": {
        "search_query": "\"Waze\" Location and route information Depending on your selected device settings and/or your account settings While you are not using the app terms conditions privacy policy explanation",
        "top_result_url": "https://repository.law.umich.edu/cgi/viewcontent.cgi?article=2523&context=mjlr",
        "top_result_title": "[PDF] Publish, Share, Re-Tweet, and Repeat",
        "summary": "See Terms of Service 3.1, FACEBOOK, https://www.facebook.com/terms.php. [https://perma.cc/PE52-AGWJ] (last visited Nov. 2, 2020) (“[U]se the same name that you."
      }
    }
  }
}